Revit 2027 API
TargetHostEdgeAndTransform.GetHostEdgeTransform Method
 Gets the transform that is associated to the host edge's geometry.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Transform GetHostEdgeTransform()
Public Function GetHostEdgeTransform As Transform
public:
Transform^ GetHostEdgeTransform()
member GetHostEdgeTransform : unit -> Transform
Return Value
Transform
 Returns the transform that is associated to the host edge's geometry.
See Also
Reference
TargetHostEdgeAndTransform Class
Autodesk.Revit.DB.Structure Namespace